
&НаСервереБезКонтекста
Функция ЗаполнитьНаСервере(Период, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвойстваОсновныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	РегистрСведений.СвойстваОсновныхСредств.СрезПоследних(&Период, ) КАК СвойстваОсновныхСредствСрезПоследних
		|ГДЕ
		|	СвойстваОсновныхСредствСрезПоследних.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияОсновногоСредства.Используется);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивОС = Новый Массив;
	ТаблицаОС = Новый ТаблицаЗначений;
	ТаблицаОС.Колонки.Добавить("ОС",,"ОС");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОС.Добавить(ВыборкаДетальныеЗаписи.ОсновноеСредство);
		НоваяСтрокаТЗ = ТаблицаОС.Добавить();
		НоваяСтрокаТЗ.ОС = ВыборкаДетальныеЗаписи.ОсновноеСредство;
	КонецЦикла;
	
	Возврат МассивОС;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	МассивОС = ЗаполнитьНаСервере(Объект.Дата, Объект.Организация);
	
	Для каждого ОС Из МассивОС Цикл
	
		СтрокаОС = Объект.ОсновныеСредства.Добавить();
		СтрокаОС.ОсновноеСредство = ОС;
	
	КонецЦикла;
	
КонецПроцедуры
