Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Проводки.Записывать = Истина;
	Движение = Движения.Проводки.Добавить();
	Движение.Период = Дата;
	
	Движение.СчетДт = ПланыСчетов.Бухгалтерский.Касса;
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "СтатьиДДС", СтатьяДДС);
	Движение.ВалютаДт = Валюта;
	Движение.ВалютнаяСуммаДт = Сумма;
	
	Движение.СчетКт = Счет;
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт,1,Субконто1);
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт,2,Субконто2);
	Если Счет.Валютный Тогда
    	Движение.ВалютаКт = Валюта;
		Движение.ВалютнаяСуммаКт = Сумма;
	КонецЕсли;
	
	Движение.Сумма = БухгалтерияСервер.РассчитатьЭквивалент(Сумма, Валюта, Дата);
	Движение.Содержание = "Поступление денег";
	Движение.Организация = Организация;
	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);	
	
КонецПроцедуры

