
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СписокОС = ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	//ПВХОС = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Основные Средства");

	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБД = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	//ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.1"));
	//ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.2"));
	//ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.3"));
	//ЭлементБД.УстановитьЗначение("Организация", Организация);
	//ЭлементБД.УстановитьЗначение("Подразделение", Подразделение);
	//ЭлементБД.ИсточникДанных = ОсновныеСредства;
	//ЭлементБД.ИспользоватьИзИсточникаДанных(ПВХОС, "ОсновноеСредство");
	//ЭлементБД.Режим = РежимБлокировкиДанных.Исключительный;
	//Блокировка.Заблокировать();	
	
	Движения.Проводки.БлокироватьДляИзменения = Истина;
	Движения.Проводки.Записывать = Истина;
	Движения.Проводки.Записать();
	
	Движения.СвойстваОсновныхСредств.Записывать = Истина;
	Движения.СвойстваОсновныхСредств.Записать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("СчетПС", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.1"));
	Запрос.УстановитьПараметр("СчетАМ", ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.2"));
	Запрос.УстановитьПараметр("списокОС", СписокОС);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиПС.Субконто1 КАК ОсновноеСредство,
	|	ОстаткиПС.СуммаОстаток КАК ОстатокПС,
	|	ОстаткиАМ.СуммаОстаток КАК ОстатокАМ
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(
	|			&Период,
	|			Счет = &СчетПС,
	|			,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И Субконто1 В (&списокОС)) КАК ОстаткиПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Проводки.Остатки(
	|				&Период,
	|				Счет = &СчетАМ,
	|				,
	|				Организация = &Организация
	|					И Подразделение = &Подразделение
	|					И Субконто1 В (&списокОС)) КАК ОстаткиАМ
	|		ПО ОстаткиПС.Субконто1 = ОстаткиАМ.Субконто1";
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.3");
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.1");
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 1, Выборка.ОсновноеСредство);
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеКт = Подразделение;
		Движение.ПодразделениеДт = Подразделение;
		Движение.Сумма = Выборка.ОстатокПС;
		Движение.Содержание = "Списание ОС";
		
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.2");
		БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, 1, Выборка.ОсновноеСредство);		
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.3");		
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеКт = Подразделение;
		Движение.ПодразделениеДт = Подразделение;
		Движение.Сумма = -Выборка.ОстатокАМ;
		Движение.Содержание = "Списание ОС";
		
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.НайтиПоКоду("1.6.3");		
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеКт = Подразделение;
		Движение.Сумма = Выборка.ОстатокПС+Выборка.ОстатокАМ;
		Движение.Содержание = "Списание ОС";
		
		Движение = Движения.СвойстваОсновныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ОсновноеСредство = Выборка.ОсновноеСредство;
		Движение.Состояние = Перечисления.СостоянияОсновногоСредства.НеИспользуется;
	
	КонецЦикла;
	
КонецПроцедуры
