
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СвойстваОсновныхСредств
	Движения.СвойстваОсновныхСредств.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеСредства Из ОсновныеСредства Цикл
		Движение = Движения.СвойстваОсновныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ОсновноеСредство = ТекСтрокаОсновныеСредства.ОсновноеСредство;
		Движение.Состояние = ТекСтрокаОсновныеСредства.Состояние;
		Движение.СрокПолезногоИспользования = ТекСтрокаОсновныеСредства.СрокПолезногоИспользования;
		Движение.МатериальноОтветственноеЛицо = ТекСтрокаОсновныеСредства.МатериальноОтвественноеЛицо;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
