
&НаКлиенте
Процедура ОчиститьПодразделенияПроводки()
	Для каждого Проводка Из Объект.движения.проводки Цикл
		ПустоеПодразделение = Новый (Тип("СправочникСсылка.Подразделения"));
		Проводка.ПодразделениеДт = ПустоеПодразделение;
		Проводка.ПодразделениеКт = ПустоеПодразделение;
	КонецЦикла; 
КонецПроцедуры // ОчиститьПодразделенияПроводки()

&НаКлиенте
Функция РасчитатьВалютнуюСумму(ИмяПоля)
	Дата = Объект.Дата;
	Если Прав(ИмяПоля, 2) = "Дт" Тогда
		Валюта = Элементы.ДвиженияПроводки.ТекущиеДанные.ВалютаДт;
		ВалютнаяСумма = Элементы.ДвиженияПроводки.ТекущиеДанные.ВалютнаяСуммаДт; 
	ИначеЕсли Прав(ИмяПоля, 2) = "Кт" Тогда
		Валюта = Элементы.ДвиженияПроводки.ТекущиеДанные.ВалютаКт;
		ВалютнаяСумма = Элементы.ДвиженияПроводки.ТекущиеДанные.ВалютнаяСуммаКт; 
	КонецЕсли; 
	Возврат ВалютнаяСумма * БухгалтерияСервер.ПолучитьКурсКратностьВалюты(Дата, Валюта);
КонецФункции
 

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОчиститьПодразделенияПроводки();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПроводкиВалютнаяСуммаДтПриИзменении(Элемент)
	Элементы.ДвиженияПроводки.ТекущиеДанные.Сумма = РасчитатьВалютнуюСумму(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПроводкиВалютаДтПриИзменении(Элемент)
	Элементы.ДвиженияПроводки.ТекущиеДанные.Сумма = РасчитатьВалютнуюСумму(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Дата = Объект.Дата;
	Для каждого Проводка Из Объект.движения.проводки Цикл
		СчетДт = БухгалтерияСерверПовторно.ПолучитьСвойстваСчета(Проводка.СчетДт);
		СчетКт = БухгалтерияСерверПовторно.ПолучитьСвойстваСчета(Проводка.СчетКт);
		СуммаВВалюте = 0;
		Если СчетДт.Валютный = ИСТИНА Тогда
			Валюта = Проводка.ВалютаДт;
			СуммаВВалюте = Проводка.ВалютнаяСуммаДт;
		ИначеЕсли СчетКт.Валютный = ИСТИНА Тогда
			Валюта = Проводка.ВалютаКт;
			СуммаВВалюте = Проводка.ВалютнаяСуммаКт;
		КонецЕсли; 
		Проводка.Сумма = СуммаВВалюте * БухгалтерияСервер.ПолучитьКурсКратностьВалюты(Дата, Валюта);;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПроводкиВалютаКтПриИзменении(Элемент)
	Элементы.ДвиженияПроводки.ТекущиеДанные.Сумма = РасчитатьВалютнуюСумму(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПроводкиВалютнаяСуммаКтПриИзменении(Элемент)
	Элементы.ДвиженияПроводки.ТекущиеДанные.Сумма = РасчитатьВалютнуюСумму(Элемент.Имя);
КонецПроцедуры
