
Процедура ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланСчетов.Ссылка,
	|	ПланСчетов.Наименование
	|ИЗ
	|	ПланСчетов.Бухгалтерский КАК ПланСчетов
	|ГДЕ
	|	НЕ ПланСчетов.Забалансовый
	|	И ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Склады)";
	
	//Запрос.УстановитьПараметр("УчетПоСкладам", Константы.УчетПоСкладам.Получить());
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СчетСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		Попытка
			ЗаблокироватьДанныеДляРедактирования(СчетСсылка);
			СчетОбъект = СчетСсылка.ПолучитьОбъект();
			ВидыСубконтоСчета = СчетОбъект.ВидыСубконто;
			СтрокаВидыСубконтоСклад = ВидыСубконтоСчета.Найти(ПланыВидовХарактеристик.ВидыСубконто.Склады, "ВидСубконто");
			Если СтрокаВидыСубконтоСклад <> Неопределено Тогда
				СтрокаВидыСубконтоСклад.Суммовой = Константы.УчетПоСкладамПоСумме.Получить();	
			КонецЕсли;
			СчетОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось изменить аналитику счета "+ВыборкаДетальныеЗаписи.Наименование;
			Сообщение.Сообщить(); 
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
