Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Проводки.Записывать = Истина;
	Движение = Движения.Проводки.Добавить();
	Движение.Период = Дата;
	
	Движение.СчетДт = Счет;
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт,1,Субконто1);
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт,2,Субконто2);
	Если Счет.Валютный Тогда
    	Движение.ВалютаДт = Валюта;
		Движение.ВалютнаяСуммаДт = Сумма;
	КонецЕсли;
	
	Движение.СчетКт = ПланыСчетов.Бухгалтерский.Касса;
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "СтатьиДДС", СтатьяДДС);
	Движение.ВалютаКт = Валюта;
	Движение.ВалютнаяСуммаКт = Сумма;
	
	Движение.Сумма = БухгалтерияСервер.РассчитатьЭквивалент(Сумма, Валюта, Дата);
	Движение.Содержание = "Расход денег";
	Движение.Организация = Организация;
	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);
	
КонецПроцедуры

