
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Проводки.БлокироватьДляИзменения = Истина;
	Движения.Проводки.Записывать = Истина;
	Движения.Проводки.Записать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
//	Запрос сломан
	"ВЫБРАТЬ
	|	ПроводкиОстатки.Субконто1 КАК Субконто1,
	|	ПроводкиОстатки.Подразделение КАК Подразделение,
	|	ПроводкиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет.Валютный, , Организация = &Организация) КАК ПроводкиОстатки";
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Проводки.Добавить();
		Движение.СчетДт = ПланыСчетов.Бухгалтерский.СчетАналитикаПереоценки;
		Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.Разница;
		Движение.Содержание = "Переоценка валюты";
		Движение.Организация = Организация;
	КонецЦикла;

КонецПроцедуры
