
&НаКлиенте
Процедура ПереключитьАктивность(Команда)
	ТекущиеДанныеСписка = Элементы.Список.ТекущиеДанные;
	Если Не ТекущиеДанныеСписка = Неопределено Тогда
		ТекущийРегистратор = ТекущиеДанныеСписка.Регистратор;
		ПереключитьАктивностьПроводокДокумента(ТекущийРегистратор);
		Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереключитьАктивностьПроводокДокумента(Документ)
	Проводки = РегистрыБухгалтерии.Проводки.СоздатьНаборЗаписей();
	Проводки.Отбор.Регистратор.Установить(Документ);
	Проводки.Прочитать();
	ТекущаяАктивность = Проводки[0].Активность;
	Проводки.УстановитьАктивность(Не ТекущаяАктивность);
	Проводки.Записать();
КонецПроцедуры
